<?php

use Illuminate\Database\Migrations\Migration;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Support\Facades\Schema;

return new class extends Migration
{
    /**
     * Run the migrations.
     */
    public function up(): void
    {
        Schema::create('specializations', function (Blueprint $table) {
            $table->id();
            $table->string('name', 255);
            $table->foreignId('section_id')->references('id')->on('sections')->onUpdate('cascade');
            $table->foreignId('created_by')->references('id')->on('admins')->onUpdate('cascade');
            $table->foreignId('updated_by')->nullable()->references('id')->on('admins')->onUpdate('cascade');
            $table->integer('com_code');
            $table->timestamps();
        });
    }

    /**
     * Reverse the migrations.
     */
    public function down(): void
    {
        Schema::dropIfExists('specializations');
    }
};







 /*


INSERT INTO `specializations` (`id`, `name`, `section_id`, `created_by`, `updated_by`, `com_code`, `created_at`, `updated_at`) VALUES
(3, 'الأشعة التشخيصية', 8, 1, NULL, 1, '2024-11-13 12:58:42', '2024-11-13 12:58:42'),
(4, 'الأشعة التداخلية', 8, 1, NULL, 1, '2024-11-13 12:58:51', '2024-11-13 12:58:51'),
(5, 'الطب النووي', 8, 1, NULL, 1, '2024-11-13 12:59:00', '2024-11-13 12:59:00'),
(6, 'أمراض القرنية والجفاف', 13, 1, NULL, 1, '2024-11-13 14:00:36', '2024-11-13 14:00:36'),
(7, 'جراحة العيون', 13, 1, NULL, 1, '2024-11-13 14:00:46', '2024-11-13 14:00:46'),
(8, 'طب العيون للأطفال', 13, 1, NULL, 1, '2024-11-13 14:00:54', '2024-11-13 14:00:54'),
(9, 'أمراض الشبكية', 13, 1, NULL, 1, '2024-11-13 14:01:03', '2024-11-13 14:01:03'),
(10, 'علاج الأورام بالإشعاع', 11, 1, NULL, 1, '2024-11-13 14:01:16', '2024-11-13 14:01:16'),
(11, 'علاج الأورام الكيميائي', 11, 1, NULL, 1, '2024-11-13 14:01:24', '2024-11-13 14:01:24'),
(12, 'الأورام النسائية', 11, 1, NULL, 1, '2024-11-13 14:01:32', '2024-11-13 14:01:32'),
(13, 'أورام الجهاز الهضمي', 11, 1, NULL, 1, '2024-11-13 14:01:42', '2024-11-13 14:01:42'),
(14, 'التخدير العام', 10, 1, NULL, 1, '2024-11-13 14:01:57', '2024-11-13 14:01:57'),
(15, 'التخدير الموضعي', 10, 1, NULL, 1, '2024-11-13 14:02:05', '2024-11-13 14:02:05'),
(16, 'العناية المركزة', 10, 1, NULL, 1, '2024-11-13 14:02:11', '2024-11-13 14:02:11'),
(17, 'الأمراض الجلدية العامة', 15, 1, NULL, 1, '2024-11-13 14:02:53', '2024-11-13 14:02:53'),
(18, 'الأمراض الجلدية التجميلية', 15, 1, NULL, 1, '2024-11-13 14:03:03', '2024-11-13 14:03:03'),
(19, 'الأمراض المناعية الجلدية', 15, 1, NULL, 1, '2024-11-13 14:03:16', '2024-11-13 14:03:16'),
(20, 'الأمراض الجلدية للأطفال', 15, 1, NULL, 1, '2024-11-13 14:03:24', '2024-11-13 14:03:24'),
(21, 'طب التوليد (متابعة الحمل والولادة)', 16, 1, NULL, 1, '2024-11-13 14:03:53', '2024-11-13 14:03:53'),
(22, 'طب النساء (مشاكل الجهاز التناسلي)', 16, 1, NULL, 1, '2024-11-13 14:04:00', '2024-11-13 14:04:00'),
(23, 'طب الخصوبة والعقم', 16, 1, NULL, 1, '2024-11-13 14:04:06', '2024-11-13 14:04:06'),
(24, 'طب الأورام النسائية', 16, 1, NULL, 1, '2024-11-13 14:04:13', '2024-11-13 14:04:13'),
(25, 'الجراحة النسائية الترميمية', 16, 1, NULL, 1, '2024-11-13 14:04:21', '2024-11-13 14:04:21'),
(26, 'الجراحة العامة', 3, 1, NULL, 1, '2024-11-13 14:05:37', '2024-11-13 14:05:37'),
(27, 'جراحة القلب والصدر', 3, 1, NULL, 1, '2024-11-13 14:05:44', '2024-11-13 14:05:44'),
(28, 'جراحة الأوعية الدموية', 3, 1, NULL, 1, '2024-11-13 14:05:52', '2024-11-13 14:05:52'),
(29, 'جراحة المخ والأعصاب', 3, 1, NULL, 1, '2024-11-13 14:05:58', '2024-11-13 14:05:58'),
(30, 'جراحة العظام', 3, 1, NULL, 1, '2024-11-13 14:06:03', '2024-11-13 14:06:03'),
(31, 'جراحة التجميل والترميم', 3, 1, NULL, 1, '2024-11-13 14:06:10', '2024-11-13 14:06:10'),
(32, 'جراحة الأطفال', 3, 1, NULL, 1, '2024-11-13 14:06:16', '2024-11-13 14:06:16'),
(33, 'جراحة المسالك البولية', 3, 1, NULL, 1, '2024-11-13 14:06:29', '2024-11-13 14:06:29'),
(34, 'أمراض القلب', 1, 1, NULL, 1, '2024-11-13 14:06:45', '2024-11-13 14:06:45'),
(35, 'أمراض الجهاز التنفسي', 1, 1, NULL, 1, '2024-11-13 14:06:52', '2024-11-13 14:06:52'),
(36, 'أمراض الكبد والجهاز الهضمي', 1, 1, NULL, 1, '2024-11-13 14:06:58', '2024-11-13 14:06:58'),
(37, 'أمراض الكلى', 1, 1, NULL, 1, '2024-11-13 14:07:05', '2024-11-13 14:07:05'),
(38, 'أمراض الدم', 1, 1, NULL, 1, '2024-11-13 14:07:11', '2024-11-13 14:07:11'),
(39, 'الأمراض المعدية', 1, 1, NULL, 1, '2024-11-13 14:07:18', '2024-11-13 14:07:18'),
(40, 'الغدد الصماء والسكري', 1, 1, NULL, 1, '2024-11-13 14:07:25', '2024-11-13 14:07:25');

    */